{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[UNK]": 0,
      "[CLS]": 1,
      "[SEP]": 2,
      "[PAD]": 3,
      "[MASK]": 4,
      "!": 5,
      "\"": 6,
      "#": 7,
      "$": 8,
      "%": 9,
      "&": 10,
      "'": 11,
      "(": 12,
      ")": 13,
      "*": 14,
      "+": 15,
      ",": 16,
      "-": 17,
      ".": 18,
      "/": 19,
      "0": 20,
      "1": 21,
      "2": 22,
      "3": 23,
      "4": 24,
      "5": 25,
      "6": 26,
      "7": 27,
      "8": 28,
      "9": 29,
      ":": 30,
      ";": 31,
      "<": 32,
      "=": 33,
      ">": 34,
      "?": 35,
      "@": 36,
      "A": 37,
      "B": 38,
      "C": 39,
      "D": 40,
      "E": 41,
      "F": 42,
      "G": 43,
      "H": 44,
      "I": 45,
      "J": 46,
      "K": 47,
      "L": 48,
      "M": 49,
      "N": 50,
      "O": 51,
      "P": 52,
      "Q": 53,
      "R": 54,
      "S": 55,
      "T": 56,
      "U": 57,
      "V": 58,
      "W": 59,
      "X": 60,
      "Y": 61,
      "Z": 62,
      "[": 63,
      "\\": 64,
      "]": 65,
      "^": 66,
      "_": 67,
      "`": 68,
      "a": 69,
      "b": 70,
      "c": 71,
      "d": 72,
      "e": 73,
      "f": 74,
      "g": 75,
      "h": 76,
      "i": 77,
      "j": 78,
      "k": 79,
      "l": 80,
      "m": 81,
      "n": 82,
      "o": 83,
      "p": 84,
      "q": 85,
      "r": 86,
      "s": 87,
      "t": 88,
      "u": 89,
      "v": 90,
      "w": 91,
      "x": 92,
      "y": 93,
      "z": 94,
      "{": 95,
      "|": 96,
      "}": 97,
      "~": 98,
      "¡": 99,
      "¢": 100,
      "£": 101,
      "¤": 102,
      "¥": 103,
      "¦": 104,
      "§": 105,
      "©": 106,
      "ª": 107,
      "«": 108,
      "¬": 109,
      "®": 110,
      "°": 111,
      "±": 112,
      "²": 113,
      "³": 114,
      "µ": 115,
      "¶": 116,
      "·": 117,
      "¹": 118,
      "º": 119,
      "»": 120,
      "¼": 121,
      "½": 122,
      "¾": 123,
      "¿": 124,
      "À": 125,
      "Á": 126,
      "Â": 127,
      "Ã": 128,
      "Ä": 129,
      "Å": 130,
      "Æ": 131,
      "Ç": 132,
      "È": 133,
      "É": 134,
      "Ê": 135,
      "Ë": 136,
      "Ì": 137,
      "Í": 138,
      "Î": 139,
      "Ï": 140,
      "Ð": 141,
      "Ñ": 142,
      "Ò": 143,
      "Ó": 144,
      "Ô": 145,
      "Õ": 146,
      "Ö": 147,
      "×": 148,
      "Ø": 149,
      "Ù": 150,
      "Ú": 151,
      "Û": 152,
      "Ü": 153,
      "Ý": 154,
      "Þ": 155,
      "ß": 156,
      "à": 157,
      "á": 158,
      "â": 159,
      "ã": 160,
      "ä": 161,
      "å": 162,
      "æ": 163,
      "ç": 164,
      "è": 165,
      "é": 166,
      "ê": 167,
      "ë": 168,
      "ì": 169,
      "í": 170,
      "î": 171,
      "ï": 172,
      "ð": 173,
      "ñ": 174,
      "ò": 175,
      "ó": 176,
      "ô": 177,
      "õ": 178,
      "ö": 179,
      "÷": 180,
      "ø": 181,
      "ù": 182,
      "ú": 183,
      "û": 184,
      "ü": 185,
      "ý": 186,
      "ÿ": 187,
      "Ā": 188,
      "ā": 189,
      "ă": 190,
      "ą": 191,
      "ć": 192,
      "Č": 193,
      "č": 194,
      "Ď": 195,
      "ď": 196,
      "Ē": 197,
      "ē": 198,
      "ę": 199,
      "Ě": 200,
      "ě": 201,
      "ĝ": 202,
      "Ī": 203,
      "ī": 204,
      "Į": 205,
      "į": 206,
      "ı": 207,
      "Ł": 208,
      "ł": 209,
      "ń": 210,
      "Ō": 211,
      "ō": 212,
      "ő": 213,
      "Œ": 214,
      "œ": 215,
      "ř": 216,
      "Ś": 217,
      "ś": 218,
      "Š": 219,
      "š": 220,
      "Ū": 221,
      "ū": 222,
      "Ž": 223,
      "ƛ": 224,
      "ȩ": 225,
      "ɢ": 226,
      "ɪ": 227,
      "ɴ": 228,
      "ʀ": 229,
      "ʏ": 230,
      "ʙ": 231,
      "ʜ": 232,
      "ʟ": 233,
      "ʰ": 234,
      "ʱ": 235,
      "ʲ": 236,
      "ʳ": 237,
      "ʴ": 238,
      "ʵ": 239,
      "ʶ": 240,
      "ʷ": 241,
      "ʸ": 242,
      "ˠ": 243,
      "ˡ": 244,
      "ˢ": 245,
      "ˣ": 246,
      "ˤ": 247,
      "̂": 248,
      "̲": 249,
      "Ͱ": 250,
      "ͱ": 251,
      "Ϳ": 252,
      "Α": 253,
      "Β": 254,
      "Γ": 255,
      "Δ": 256,
      "Ε": 257,
      "Ζ": 258,
      "Η": 259,
      "Θ": 260,
      "Ι": 261,
      "Κ": 262,
      "Λ": 263,
      "Μ": 264,
      "Ν": 265,
      "Ξ": 266,
      "Ο": 267,
      "Π": 268,
      "Ρ": 269,
      "Σ": 270,
      "Τ": 271,
      "Υ": 272,
      "Φ": 273,
      "Χ": 274,
      "Ψ": 275,
      "Ω": 276,
      "α": 277,
      "β": 278,
      "γ": 279,
      "δ": 280,
      "ε": 281,
      "ζ": 282,
      "η": 283,
      "θ": 284,
      "ι": 285,
      "κ": 286,
      "λ": 287,
      "μ": 288,
      "ν": 289,
      "ξ": 290,
      "ο": 291,
      "π": 292,
      "ρ": 293,
      "ς": 294,
      "σ": 295,
      "τ": 296,
      "υ": 297,
      "φ": 298,
      "χ": 299,
      "ψ": 300,
      "ω": 301,
      "ϐ": 302,
      "ϑ": 303,
      "ϕ": 304,
      "ϖ": 305,
      "ϗ": 306,
      "Ϛ": 307,
      "ϛ": 308,
      "Ϝ": 309,
      "ϝ": 310,
      "Ϟ": 311,
      "ϟ": 312,
      "Ϡ": 313,
      "ϡ": 314,
      "Ϣ": 315,
      "ϣ": 316,
      "Ϥ": 317,
      "ϥ": 318,
      "Ϧ": 319,
      "ϧ": 320,
      "Ϩ": 321,
      "ϩ": 322,
      "Ϫ": 323,
      "ϫ": 324,
      "Ϭ": 325,
      "ϭ": 326,
      "Ϯ": 327,
      "ϯ": 328,
      "ϰ": 329,
      "ϱ": 330,
      "Ϸ": 331,
      "ϸ": 332,
      "Ϻ": 333,
      "ϻ": 334,
      "฿": 335,
      "ᗮ": 336,
      "ᘁ": 337,
      "ᴀ": 338,
      "ᴄ": 339,
      "ᴅ": 340,
      "ᴇ": 341,
      "ᴊ": 342,
      "ᴋ": 343,
      "ᴍ": 344,
      "ᴏ": 345,
      "ᴘ": 346,
      "ᴛ": 347,
      "ᴜ": 348,
      "ᴠ": 349,
      "ᴡ": 350,
      "ᴢ": 351,
      "ᴬ": 352,
      "ᴭ": 353,
      "ᴮ": 354,
      "ᴯ": 355,
      "ᴰ": 356,
      "ᴱ": 357,
      "ᴲ": 358,
      "ᴳ": 359,
      "ᴴ": 360,
      "ᴵ": 361,
      "ᴶ": 362,
      "ᴷ": 363,
      "ᴸ": 364,
      "ᴹ": 365,
      "ᴺ": 366,
      "ᴻ": 367,
      "ᴼ": 368,
      "ᴽ": 369,
      "ᴾ": 370,
      "ᴿ": 371,
      "ᵀ": 372,
      "ᵁ": 373,
      "ᵂ": 374,
      "ᵃ": 375,
      "ᵄ": 376,
      "ᵅ": 377,
      "ᵆ": 378,
      "ᵇ": 379,
      "ᵈ": 380,
      "ᵉ": 381,
      "ᵊ": 382,
      "ᵋ": 383,
      "ᵌ": 384,
      "ᵍ": 385,
      "ᵎ": 386,
      "ᵏ": 387,
      "ᵐ": 388,
      "ᵑ": 389,
      "ᵒ": 390,
      "ᵓ": 391,
      "ᵔ": 392,
      "ᵕ": 393,
      "ᵖ": 394,
      "ᵗ": 395,
      "ᵘ": 396,
      "ᵙ": 397,
      "ᵚ": 398,
      "ᵛ": 399,
      "ᵜ": 400,
      "ᵝ": 401,
      "ᵞ": 402,
      "ᵟ": 403,
      "ᵠ": 404,
      "ᵡ": 405,
      "ᵢ": 406,
      "ᵣ": 407,
      "ᵤ": 408,
      "ᵥ": 409,
      "ᵦ": 410,
      "ᵧ": 411,
      "ᵨ": 412,
      "ᵩ": 413,
      "ᵪ": 414,
      "ᶛ": 415,
      "ᶜ": 416,
      "ᶝ": 417,
      "ᶞ": 418,
      "ᶟ": 419,
      "ᶠ": 420,
      "ᶢ": 421,
      "ᶣ": 422,
      "ᶤ": 423,
      "ᶥ": 424,
      "ᶦ": 425,
      "ᶧ": 426,
      "ᶨ": 427,
      "ᶩ": 428,
      "ᶪ": 429,
      "ᶫ": 430,
      "ᶬ": 431,
      "ᶭ": 432,
      "ᶮ": 433,
      "ᶯ": 434,
      "ᶰ": 435,
      "ᶱ": 436,
      "ᶲ": 437,
      "ᶳ": 438,
      "ᶴ": 439,
      "ᶵ": 440,
      "ᶶ": 441,
      "ᶷ": 442,
      "ᶸ": 443,
      "ᶹ": 444,
      "ᶺ": 445,
      "ᶻ": 446,
      "ᶼ": 447,
      "ᶽ": 448,
      "ᶾ": 449,
      "ᶿ": 450,
      "ầ": 451,
      "ỳ": 452,
      "‐": 453,
      "‑": 454,
      "–": 455,
      "—": 456,
      "‖": 457,
      "‘": 458,
      "’": 459,
      "‚": 460,
      "“": 461,
      "”": 462,
      "„": 463,
      "†": 464,
      "‡": 465,
      "•": 466,
      "‣": 467,
      "…": 468,
      "‰": 469,
      "‱": 470,
      "′": 471,
      "‵": 472,
      "‹": 473,
      "›": 474,
      "※": 475,
      "‼": 476,
      "‽": 477,
      "‾": 478,
      "‿": 479,
      "⁀": 480,
      "⁄": 481,
      "⁅": 482,
      "⁆": 483,
      "⁇": 484,
      "⁉": 485,
      "⁎": 486,
      "⁒": 487,
      "⁫": 488,
      "⁬": 489,
      "⁰": 490,
      "ⁱ": 491,
      "⁴": 492,
      "⁵": 493,
      "⁶": 494,
      "⁷": 495,
      "⁸": 496,
      "⁹": 497,
      "⁺": 498,
      "⁻": 499,
      "⁼": 500,
      "⁽": 501,
      "⁾": 502,
      "ⁿ": 503,
      "₀": 504,
      "₁": 505,
      "₂": 506,
      "₃": 507,
      "₄": 508,
      "₅": 509,
      "₆": 510,
      "₇": 511,
      "₈": 512,
      "₉": 513,
      "₊": 514,
      "₋": 515,
      "₌": 516,
      "₍": 517,
      "₎": 518,
      "ₐ": 519,
      "ₑ": 520,
      "ₒ": 521,
      "ₓ": 522,
      "ₕ": 523,
      "ₖ": 524,
      "ₗ": 525,
      "ₘ": 526,
      "ₙ": 527,
      "ₚ": 528,
      "ₛ": 529,
      "ₜ": 530,
      "₡": 531,
      "₢": 532,
      "₤": 533,
      "₥": 534,
      "₦": 535,
      "₧": 536,
      "₨": 537,
      "₩": 538,
      "₫": 539,
      "€": 540,
      "₭": 541,
      "₮": 542,
      "₯": 543,
      "₱": 544,
      "₲": 545,
      "₳": 546,
      "₴": 547,
      "₵": 548,
      "₷": 549,
      "₸": 550,
      "₼": 551,
      "₽": 552,
      "₾": 553,
      "ℂ": 554,
      "℃": 555,
      "ℊ": 556,
      "ℋ": 557,
      "ℌ": 558,
      "ℍ": 559,
      "ℏ": 560,
      "ℐ": 561,
      "ℑ": 562,
      "ℒ": 563,
      "ℓ": 564,
      "ℕ": 565,
      "№": 566,
      "℗": 567,
      "℘": 568,
      "ℙ": 569,
      "ℚ": 570,
      "ℛ": 571,
      "ℜ": 572,
      "ℝ": 573,
      "℞": 574,
      "℠": 575,
      "℡": 576,
      "™": 577,
      "ℤ": 578,
      "℥": 579,
      "Ω": 580,
      "℧": 581,
      "ℨ": 582,
      "K": 583,
      "Å": 584,
      "ℬ": 585,
      "ℭ": 586,
      "℮": 587,
      "ℯ": 588,
      "ℰ": 589,
      "ℱ": 590,
      "ℳ": 591,
      "ℴ": 592,
      "ℵ": 593,
      "ℶ": 594,
      "ℷ": 595,
      "ℸ": 596,
      "℻": 597,
      "⅀": 598,
      "⅋": 599,
      "⅌": 600,
      "⅓": 601,
      "⅔": 602,
      "⅕": 603,
      "⅖": 604,
      "⅗": 605,
      "⅘": 606,
      "⅙": 607,
      "⅚": 608,
      "⅛": 609,
      "⅜": 610,
      "⅝": 611,
      "⅞": 612,
      "⅟": 613,
      "←": 614,
      "↑": 615,
      "→": 616,
      "↓": 617,
      "↔": 618,
      "↕": 619,
      "↖": 620,
      "↗": 621,
      "↘": 622,
      "↙": 623,
      "↚": 624,
      "↛": 625,
      "↜": 626,
      "↝": 627,
      "↞": 628,
      "↟": 629,
      "↠": 630,
      "↡": 631,
      "↢": 632,
      "↣": 633,
      "↤": 634,
      "↥": 635,
      "↦": 636,
      "↧": 637,
      "↨": 638,
      "↩": 639,
      "↪": 640,
      "↫": 641,
      "↬": 642,
      "↭": 643,
      "↮": 644,
      "↯": 645,
      "↰": 646,
      "↱": 647,
      "↶": 648,
      "↷": 649,
      "↺": 650,
      "↻": 651,
      "↼": 652,
      "↽": 653,
      "↾": 654,
      "↿": 655,
      "⇀": 656,
      "⇁": 657,
      "⇂": 658,
      "⇃": 659,
      "⇄": 660,
      "⇅": 661,
      "⇆": 662,
      "⇇": 663,
      "⇈": 664,
      "⇉": 665,
      "⇊": 666,
      "⇋": 667,
      "⇌": 668,
      "⇍": 669,
      "⇎": 670,
      "⇏": 671,
      "⇐": 672,
      "⇑": 673,
      "⇒": 674,
      "⇓": 675,
      "⇔": 676,
      "⇕": 677,
      "⇖": 678,
      "⇗": 679,
      "⇘": 680,
      "⇙": 681,
      "⇚": 682,
      "⇛": 683,
      "⇝": 684,
      "⇨": 685,
      "⇰": 686,
      "⇵": 687,
      "⇶": 688,
      "∀": 689,
      "∁": 690,
      "∂": 691,
      "∃": 692,
      "∄": 693,
      "∅": 694,
      "∆": 695,
      "∇": 696,
      "∈": 697,
      "∉": 698,
      "∋": 699,
      "∌": 700,
      "∍": 701,
      "∎": 702,
      "∏": 703,
      "∐": 704,
      "∑": 705,
      "−": 706,
      "∓": 707,
      "∔": 708,
      "∖": 709,
      "∗": 710,
      "∘": 711,
      "∙": 712,
      "√": 713,
      "∛": 714,
      "∜": 715,
      "∝": 716,
      "∞": 717,
      "∟": 718,
      "∠": 719,
      "∡": 720,
      "∢": 721,
      "∣": 722,
      "∤": 723,
      "∥": 724,
      "∦": 725,
      "∧": 726,
      "∨": 727,
      "∩": 728,
      "∪": 729,
      "∫": 730,
      "∮": 731,
      "∯": 732,
      "∴": 733,
      "∵": 734,
      "∶": 735,
      "∷": 736,
      "∸": 737,
      "∹": 738,
      "∺": 739,
      "∻": 740,
      "∼": 741,
      "∽": 742,
      "≀": 743,
      "≁": 744,
      "≂": 745,
      "≃": 746,
      "≄": 747,
      "≅": 748,
      "≇": 749,
      "≈": 750,
      "≉": 751,
      "≊": 752,
      "≋": 753,
      "≌": 754,
      "≍": 755,
      "≎": 756,
      "≏": 757,
      "≐": 758,
      "≑": 759,
      "≒": 760,
      "≓": 761,
      "≔": 762,
      "≕": 763,
      "≖": 764,
      "≗": 765,
      "≘": 766,
      "≙": 767,
      "≚": 768,
      "≛": 769,
      "≜": 770,
      "≝": 771,
      "≞": 772,
      "≟": 773,
      "≠": 774,
      "≡": 775,
      "≢": 776,
      "≣": 777,
      "≤": 778,
      "≥": 779,
      "≦": 780,
      "≧": 781,
      "≨": 782,
      "≩": 783,
      "≪": 784,
      "≫": 785,
      "≬": 786,
      "≮": 787,
      "≯": 788,
      "≰": 789,
      "≱": 790,
      "≲": 791,
      "≳": 792,
      "≴": 793,
      "≵": 794,
      "≶": 795,
      "≷": 796,
      "≺": 797,
      "≻": 798,
      "≼": 799,
      "≽": 800,
      "≾": 801,
      "≿": 802,
      "⊀": 803,
      "⊁": 804,
      "⊂": 805,
      "⊃": 806,
      "⊄": 807,
      "⊅": 808,
      "⊆": 809,
      "⊇": 810,
      "⊈": 811,
      "⊉": 812,
      "⊊": 813,
      "⊋": 814,
      "⊍": 815,
      "⊎": 816,
      "⊏": 817,
      "⊐": 818,
      "⊑": 819,
      "⊒": 820,
      "⊓": 821,
      "⊔": 822,
      "⊕": 823,
      "⊖": 824,
      "⊗": 825,
      "⊘": 826,
      "⊙": 827,
      "⊚": 828,
      "⊛": 829,
      "⊜": 830,
      "⊝": 831,
      "⊞": 832,
      "⊟": 833,
      "⊠": 834,
      "⊡": 835,
      "⊢": 836,
      "⊣": 837,
      "⊤": 838,
      "⊥": 839,
      "⊧": 840,
      "⊨": 841,
      "⊩": 842,
      "⊪": 843,
      "⊫": 844,
      "⊬": 845,
      "⊭": 846,
      "⊮": 847,
      "⊯": 848,
      "⊲": 849,
      "⊳": 850,
      "⊴": 851,
      "⊵": 852,
      "⊸": 853,
      "⊹": 854,
      "⊺": 855,
      "⊻": 856,
      "⊼": 857,
      "⋀": 858,
      "⋁": 859,
      "⋂": 860,
      "⋃": 861,
      "⋄": 862,
      "⋅": 863,
      "⋆": 864,
      "⋇": 865,
      "⋈": 866,
      "⋉": 867,
      "⋊": 868,
      "⋋": 869,
      "⋌": 870,
      "⋍": 871,
      "⋎": 872,
      "⋏": 873,
      "⋐": 874,
      "⋑": 875,
      "⋒": 876,
      "⋓": 877,
      "⋔": 878,
      "⋖": 879,
      "⋗": 880,
      "⋘": 881,
      "⋙": 882,
      "⋚": 883,
      "⋛": 884,
      "⋜": 885,
      "⋝": 886,
      "⋞": 887,
      "⋟": 888,
      "⋠": 889,
      "⋡": 890,
      "⋢": 891,
      "⋣": 892,
      "⋦": 893,
      "⋧": 894,
      "⋨": 895,
      "⋩": 896,
      "⋪": 897,
      "⋫": 898,
      "⋬": 899,
      "⋭": 900,
      "⋮": 901,
      "⋯": 902,
      "⋱": 903,
      "⌀": 904,
      "⌈": 905,
      "⌉": 906,
      "⌊": 907,
      "⌋": 908,
      "⌜": 909,
      "⌝": 910,
      "⌞": 911,
      "⌟": 912,
      "⌢": 913,
      "⌣": 914,
      "⌶": 915,
      "⍟": 916,
      "⎛": 917,
      "⎜": 918,
      "⎝": 919,
      "⎞": 920,
      "⎟": 921,
      "⎠": 922,
      "⎯": 923,
      "⏎": 924,
      "⏐": 925,
      "⏳": 926,
      "Ⓢ": 927,
      "─": 928,
      "━": 929,
      "│": 930,
      "┌": 931,
      "┐": 932,
      "└": 933,
      "┘": 934,
      "├": 935,
      "┬": 936,
      "╌": 937,
      "═": 938,
      "╭": 939,
      "╮": 940,
      "╯": 941,
      "╰": 942,
      "╱": 943,
      "■": 944,
      "□": 945,
      "▢": 946,
      "▣": 947,
      "▪": 948,
      "▬": 949,
      "▭": 950,
      "▰": 951,
      "▱": 952,
      "△": 953,
      "▴": 954,
      "▵": 955,
      "▶": 956,
      "▷": 957,
      "▸": 958,
      "▹": 959,
      "▼": 960,
      "▽": 961,
      "▾": 962,
      "▿": 963,
      "◀": 964,
      "◁": 965,
      "◂": 966,
      "◃": 967,
      "◄": 968,
      "◆": 969,
      "◇": 970,
      "◈": 971,
      "○": 972,
      "◌": 973,
      "◎": 974,
      "●": 975,
      "◢": 976,
      "◥": 977,
      "◦": 978,
      "◫": 979,
      "◯": 980,
      "◹": 981,
      "◾": 982,
      "◿": 983,
      "★": 984,
      "☡": 985,
      "☢": 986,
      "☣": 987,
      "☹": 988,
      "☺": 989,
      "☻": 990,
      "♀": 991,
      "♂": 992,
      "♠": 993,
      "♢": 994,
      "♣": 995,
      "♥": 996,
      "♩": 997,
      "♪": 998,
      "♭": 999,
      "♮": 1000,
      "♯": 1001,
      "⚀": 1002,
      "⚠": 1003,
      "⚬": 1004,
      "✂": 1005,
      "✅": 1006,
      "✉": 1007,
      "✓": 1008,
      "✔": 1009,
      "✗": 1010,
      "✝": 1011,
      "✠": 1012,
      "✦": 1013,
      "✧": 1014,
      "✴": 1015,
      "✶": 1016,
      "✹": 1017,
      "❌": 1018,
      "⟂": 1019,
      "⟅": 1020,
      "⟆": 1021,
      "⟋": 1022,
      "⟍": 1023,
      "⟦": 1024,
      "⟧": 1025,
      "⟨": 1026,
      "⟩": 1027,
      "⟪": 1028,
      "⟫": 1029,
      "⟮": 1030,
      "⟯": 1031,
      "⟰": 1032,
      "⟱": 1033,
      "⟵": 1034,
      "⟶": 1035,
      "⟷": 1036,
      "⟹": 1037,
      "⤏": 1038,
      "⤞": 1039,
      "⤳": 1040,
      "⥢": 1041,
      "⥤": 1042,
      "⥥": 1043,
      "⦃": 1044,
      "⦄": 1045,
      "⦋": 1046,
      "⦌": 1047,
      "⧏": 1048,
      "⧸": 1049,
      "⧾": 1050,
      "⧿": 1051,
      "⨀": 1052,
      "⨁": 1053,
      "⨂": 1054,
      "⨃": 1055,
      "⨄": 1056,
      "⨅": 1057,
      "⨆": 1058,
      "⨍": 1059,
      "⨯": 1060,
      "⨿": 1061,
      "⩿": 1062,
      "⬝": 1063,
      "⯑": 1064,
      "ⱼ": 1065,
      "ⱽ": 1066,
      "⸨": 1067,
      "⸩": 1068,
      "《": 1069,
      "》": 1070,
      "〚": 1071,
      "〛": 1072,
      "㉐": 1073,
      "꙳": 1074,
      "ꜰ": 1075,
      "ꜱ": 1076,
      "ꞯ": 1077,
      "ꟴ": 1078,
      "ꟸ": 1079,
      "ꟹ": 1080,
      "ꭜ": 1081,
      "ꭝ": 1082,
      "ꭞ": 1083,
      "ꭟ": 1084,
      "즊": 1085,
      "️": 1086,
      "﹨": 1087,
      "－": 1088,
      "／": 1089,
      "：": 1090,
      "＼": 1091,
      "￢": 1092,
      "𐆎": 1093,
      "𐞥": 1094,
      "𘔗": 1095,
      "𝐀": 1096,
      "𝐁": 1097,
      "𝐂": 1098,
      "𝐃": 1099,
      "𝐄": 1100,
      "𝐅": 1101,
      "𝐆": 1102,
      "𝐇": 1103,
      "𝐈": 1104,
      "𝐉": 1105,
      "𝐊": 1106,
      "𝐋": 1107,
      "𝐌": 1108,
      "𝐍": 1109,
      "𝐎": 1110,
      "𝐏": 1111,
      "𝐐": 1112,
      "𝐑": 1113,
      "𝐒": 1114,
      "𝐓": 1115,
      "𝐔": 1116,
      "𝐕": 1117,
      "𝐖": 1118,
      "𝐗": 1119,
      "𝐘": 1120,
      "𝐙": 1121,
      "𝐚": 1122,
      "𝐛": 1123,
      "𝐜": 1124,
      "𝐝": 1125,
      "𝐞": 1126,
      "𝐟": 1127,
      "𝐠": 1128,
      "𝐡": 1129,
      "𝐢": 1130,
      "𝐣": 1131,
      "𝐤": 1132,
      "𝐥": 1133,
      "𝐦": 1134,
      "𝐧": 1135,
      "𝐨": 1136,
      "𝐩": 1137,
      "𝐪": 1138,
      "𝐫": 1139,
      "𝐬": 1140,
      "𝐭": 1141,
      "𝐮": 1142,
      "𝐯": 1143,
      "𝐰": 1144,
      "𝐱": 1145,
      "𝐲": 1146,
      "𝐳": 1147,
      "𝐴": 1148,
      "𝐵": 1149,
      "𝐶": 1150,
      "𝐷": 1151,
      "𝐸": 1152,
      "𝐹": 1153,
      "𝐺": 1154,
      "𝐻": 1155,
      "𝐼": 1156,
      "𝐽": 1157,
      "𝐾": 1158,
      "𝐿": 1159,
      "𝑀": 1160,
      "𝑁": 1161,
      "𝑂": 1162,
      "𝑃": 1163,
      "𝑄": 1164,
      "𝑅": 1165,
      "𝑆": 1166,
      "𝑇": 1167,
      "𝑈": 1168,
      "𝑉": 1169,
      "𝑊": 1170,
      "𝑋": 1171,
      "𝑌": 1172,
      "𝑍": 1173,
      "𝑎": 1174,
      "𝑏": 1175,
      "𝑐": 1176,
      "𝑑": 1177,
      "𝑒": 1178,
      "𝑓": 1179,
      "𝑔": 1180,
      "𝑖": 1181,
      "𝑗": 1182,
      "𝑘": 1183,
      "𝑙": 1184,
      "𝑚": 1185,
      "𝑛": 1186,
      "𝑜": 1187,
      "𝑝": 1188,
      "𝑞": 1189,
      "𝑟": 1190,
      "𝑠": 1191,
      "𝑡": 1192,
      "𝑢": 1193,
      "𝑣": 1194,
      "𝑤": 1195,
      "𝑥": 1196,
      "𝑦": 1197,
      "𝑧": 1198,
      "𝑨": 1199,
      "𝑩": 1200,
      "𝑪": 1201,
      "𝑫": 1202,
      "𝑬": 1203,
      "𝑭": 1204,
      "𝑮": 1205,
      "𝑯": 1206,
      "𝑰": 1207,
      "𝑱": 1208,
      "𝑲": 1209,
      "𝑳": 1210,
      "𝑴": 1211,
      "𝑵": 1212,
      "𝑶": 1213,
      "𝑷": 1214,
      "𝑸": 1215,
      "𝑹": 1216,
      "𝑺": 1217,
      "𝑻": 1218,
      "𝑼": 1219,
      "𝑽": 1220,
      "𝑾": 1221,
      "𝑿": 1222,
      "𝒀": 1223,
      "𝒁": 1224,
      "𝒂": 1225,
      "𝒃": 1226,
      "𝒄": 1227,
      "𝒅": 1228,
      "𝒆": 1229,
      "𝒇": 1230,
      "𝒈": 1231,
      "𝒉": 1232,
      "𝒊": 1233,
      "𝒋": 1234,
      "𝒌": 1235,
      "𝒍": 1236,
      "𝒎": 1237,
      "𝒏": 1238,
      "𝒐": 1239,
      "𝒑": 1240,
      "𝒒": 1241,
      "𝒓": 1242,
      "𝒔": 1243,
      "𝒕": 1244,
      "𝒖": 1245,
      "𝒗": 1246,
      "𝒘": 1247,
      "𝒙": 1248,
      "𝒚": 1249,
      "𝒛": 1250,
      "𝒜": 1251,
      "𝒞": 1252,
      "𝒟": 1253,
      "𝒢": 1254,
      "𝒥": 1255,
      "𝒦": 1256,
      "𝒩": 1257,
      "𝒪": 1258,
      "𝒫": 1259,
      "𝒬": 1260,
      "𝒮": 1261,
      "𝒯": 1262,
      "𝒰": 1263,
      "𝒱": 1264,
      "𝒲": 1265,
      "𝒳": 1266,
      "𝒴": 1267,
      "𝒵": 1268,
      "𝒶": 1269,
      "𝒷": 1270,
      "𝒸": 1271,
      "𝒹": 1272,
      "𝒻": 1273,
      "𝒽": 1274,
      "𝒾": 1275,
      "𝒿": 1276,
      "𝓀": 1277,
      "𝓁": 1278,
      "𝓂": 1279,
      "𝓃": 1280,
      "𝓅": 1281,
      "𝓆": 1282,
      "𝓇": 1283,
      "𝓈": 1284,
      "𝓉": 1285,
      "𝓊": 1286,
      "𝓋": 1287,
      "𝓌": 1288,
      "𝓍": 1289,
      "𝓎": 1290,
      "𝓏": 1291,
      "𝓐": 1292,
      "𝓑": 1293,
      "𝓒": 1294,
      "𝓓": 1295,
      "𝓔": 1296,
      "𝓕": 1297,
      "𝓖": 1298,
      "𝓗": 1299,
      "𝓘": 1300,
      "𝓙": 1301,
      "𝓚": 1302,
      "𝓛": 1303,
      "𝓜": 1304,
      "𝓝": 1305,
      "𝓞": 1306,
      "𝓟": 1307,
      "𝓠": 1308,
      "𝓡": 1309,
      "𝓢": 1310,
      "𝓣": 1311,
      "𝓤": 1312,
      "𝓥": 1313,
      "𝓦": 1314,
      "𝓧": 1315,
      "𝓨": 1316,
      "𝓩": 1317,
      "𝓪": 1318,
      "𝓫": 1319,
      "𝓬": 1320,
      "𝓭": 1321,
      "𝓮": 1322,
      "𝓯": 1323,
      "𝓰": 1324,
      "𝓱": 1325,
      "𝓲": 1326,
      "𝓳": 1327,
      "𝓴": 1328,
      "𝓵": 1329,
      "𝓶": 1330,
      "𝓷": 1331,
      "𝓸": 1332,
      "𝓹": 1333,
      "𝓺": 1334,
      "𝓻": 1335,
      "𝓼": 1336,
      "𝓽": 1337,
      "𝓾": 1338,
      "𝓿": 1339,
      "𝔀": 1340,
      "𝔁": 1341,
      "𝔂": 1342,
      "𝔃": 1343,
      "𝔄": 1344,
      "𝔅": 1345,
      "𝔇": 1346,
      "𝔈": 1347,
      "𝔉": 1348,
      "𝔊": 1349,
      "𝔍": 1350,
      "𝔎": 1351,
      "𝔏": 1352,
      "𝔐": 1353,
      "𝔑": 1354,
      "𝔒": 1355,
      "𝔓": 1356,
      "𝔔": 1357,
      "𝔖": 1358,
      "𝔗": 1359,
      "𝔘": 1360,
      "𝔙": 1361,
      "𝔚": 1362,
      "𝔛": 1363,
      "𝔜": 1364,
      "𝔞": 1365,
      "𝔟": 1366,
      "𝔠": 1367,
      "𝔡": 1368,
      "𝔢": 1369,
      "𝔣": 1370,
      "𝔤": 1371,
      "𝔥": 1372,
      "𝔦": 1373,
      "𝔧": 1374,
      "𝔨": 1375,
      "𝔩": 1376,
      "𝔪": 1377,
      "𝔫": 1378,
      "𝔬": 1379,
      "𝔭": 1380,
      "𝔮": 1381,
      "𝔯": 1382,
      "𝔰": 1383,
      "𝔱": 1384,
      "𝔲": 1385,
      "𝔳": 1386,
      "𝔴": 1387,
      "𝔵": 1388,
      "𝔶": 1389,
      "𝔷": 1390,
      "𝔸": 1391,
      "𝔹": 1392,
      "𝔻": 1393,
      "𝔼": 1394,
      "𝔽": 1395,
      "𝔾": 1396,
      "𝕀": 1397,
      "𝕁": 1398,
      "𝕂": 1399,
      "𝕃": 1400,
      "𝕄": 1401,
      "𝕆": 1402,
      "𝕊": 1403,
      "𝕋": 1404,
      "𝕌": 1405,
      "𝕍": 1406,
      "𝕎": 1407,
      "𝕏": 1408,
      "𝕐": 1409,
      "𝕒": 1410,
      "𝕓": 1411,
      "𝕔": 1412,
      "𝕕": 1413,
      "𝕖": 1414,
      "𝕗": 1415,
      "𝕘": 1416,
      "𝕙": 1417,
      "𝕚": 1418,
      "𝕛": 1419,
      "𝕜": 1420,
      "𝕝": 1421,
      "𝕞": 1422,
      "𝕟": 1423,
      "𝕠": 1424,
      "𝕡": 1425,
      "𝕢": 1426,
      "𝕣": 1427,
      "𝕤": 1428,
      "𝕥": 1429,
      "𝕦": 1430,
      "𝕧": 1431,
      "𝕨": 1432,
      "𝕩": 1433,
      "𝕪": 1434,
      "𝕫": 1435,
      "𝖣": 1436,
      "𝟘": 1437,
      "𝟙": 1438,
      "𝟚": 1439,
      "𝟛": 1440,
      "𝟜": 1441,
      "𝟝": 1442,
      "𝟞": 1443,
      "𝟟": 1444,
      "𝟠": 1445,
      "𝟡": 1446,
      "𝟬": 1447,
      "𝟭": 1448,
      "𝟮": 1449,
      "𝟯": 1450,
      "𝟰": 1451,
      "𝟱": 1452,
      "𝟲": 1453,
      "𝟳": 1454,
      "𝟴": 1455,
      "𝟵": 1456,
      "🎉": 1457,
      "🏁": 1458,
      "🐙": 1459,
      "💡": 1460,
      "💥": 1461,
      "🔍": 1462,
      "🚧": 1463,
      "🛇": 1464,
      "🛑": 1465,
      "🟡": 1466,
      "𫍄": 1467,
      "񩩰": 1468,
      "򆉧": 1469,
      "򉔥": 1470,
      "򙷒": 1471,
      "in": 1472,
      "on": 1473,
      "le": 1474,
      "er": 1475,
      "or": 1476,
      "th": 1477,
      "al": 1478,
      "mp": 1479,
      "ti": 1480,
      ":=": 1481,
      "is": 1482,
      "en": 1483,
      "re": 1484,
      "an": 1485,
      "un": 1486,
      "se": 1487,
      "at": 1488,
      "ar": 1489,
      "ap": 1490,
      "om": 1491,
      "si": 1492,
      "of": 1493,
      "the": 1494,
      "su": 1495,
      "ct": 1496,
      "em": 1497,
      "ro": 1498,
      "ul": 1499,
      "st": 1500,
      "tion": 1501,
      "co": 1502,
      "by": 1503,
      "it": 1504,
      "if": 1505,
      "ing": 1506,
      "ce": 1507,
      "ve": 1508,
      "de": 1509,
      "ri": 1510,
      "to": 1511,
      "simp": 1512,
      "ly": 1513,
      "ab": 1514,
      "eq": 1515,
      "li": 1516,
      "ex": 1517,
      "as": 1518,
      "t_": 1519,
      "ge": 1520,
      "fun": 1521,
      "ed": 1522,
      "Is": 1523,
      "iv": 1524,
      ").": 1525,
      "con": 1526,
      "mul": 1527,
      "able": 1528,
      "orem": 1529,
      "theorem": 1530,
      "dd": 1531,
      "po": 1532,
      "iff": 1533,
      "ma": 1534,
      "eg": 1535,
      "of_": 1536,
      "pe": 1537,
      "lo": 1538,
      "du": 1539,
      "map": 1540,
      "et": 1541,
      "int": 1542,
      "e_": 1543,
      "--": 1544,
      "Co": 1545,
      "rw": 1546,
      "-/": 1547,
      "ction": 1548,
      "ra": 1549,
      "ub": 1550,
      "In": 1551,
      "us": 1552,
      "eq_": 1553,
      "comp": 1554,
      "ine": 1555,
      "act": 1556,
      "ith": 1557,
      "he": 1558,
      "@[": 1559,
      "tive": 1560,
      "ero": 1561,
      "=>": 1562,
      "orm": 1563,
      "pa": 1564,
      "ype": 1565,
      "ent": 1566,
      "id": 1567,
      "pro": 1568,
      "ha": 1569,
      "op": 1570,
      "app": 1571,
      "add": 1572,
      "gh": 1573,
      "/--": 1574,
      "_of_": 1575,
      "der": 1576,
      "lem": 1577,
      "))": 1578,
      "sub": 1579,
      "Fin": 1580,
      "es": 1581,
      "ran": 1582,
      "cal": 1583,
      "qu": 1584,
      "up": 1585,
      "Set": 1586,
      "mul_": 1587,
      "end": 1588,
      "set": 1589,
      "mem": 1590,
      "fl": 1591,
      "zero": 1592,
      "ea": 1593,
      "_n": 1594,
      "lic": 1595,
      "ono": 1596,
      "pace": 1597,
      "def": 1598,
      "omm": 1599,
      "ch": 1600,
      "Con": 1601,
      "ght": 1602,
      "_eq_": 1603,
      "_iff": 1604,
      "Hom": 1605,
      "Re": 1606,
      "bra": 1607,
      "apply": 1608,
      "rfl": 1609,
      "and": 1610,
      "lemma": 1611,
      "ot": 1612,
      "ance": 1613,
      "exact": 1614,
      "ver": 1615,
      "_le": 1616,
      "gebra": 1617,
      "ist": 1618,
      "easu": 1619,
      "ation": 1620,
      "mm": 1621,
      "ec": 1622,
      "hf": 1623,
      "odu": 1624,
      "ari": 1625,
      "ory": 1626,
      "`.": 1627,
      "Fun": 1628,
      "uo": 1629,
      "Map": 1630,
      "ort": 1631,
      "Sub": 1632,
      "Al": 1633,
      "odule": 1634,
      "one": 1635,
      "The": 1636,
      "res": 1637,
      "imp": 1638,
      "il": 1639,
      "_s": 1640,
      "vari": 1641,
      "ard": 1642,
      "wh": 1643,
      "Un": 1644,
      "let": 1645,
      "for": 1646,
      "ut": 1647,
      "ymm": 1648,
      "el": 1649,
      "ac": 1650,
      "with": 1651,
      "inear": 1652,
      "tin": 1653,
      "Type": 1654,
      "ob": 1655,
      "Ma": 1656,
      "have": 1657,
      "inst": 1658,
      "log": 1659,
      "ft": 1660,
      "Equ": 1661,
      "ass": 1662,
      "Comp": 1663,
      "ext": 1664,
      "uous": 1665,
      "tinuous": 1666,
      "ca": 1667,
      "variable": 1668,
      "Pro": 1669,
      "hx": 1670,
      "right": 1671,
      "Equiv": 1672,
      "ite": 1673,
      "Mul": 1674,
      "hom": 1675,
      "im": 1676,
      "ctor": 1677,
      "ter": 1678,
      "am": 1679,
      "roup": 1680,
      "ublic": 1681,
      "fi": 1682,
      "On": 1683,
      "ru": 1684,
      "public": 1685,
      "Cat": 1686,
      "To": 1687,
      "ective": 1688,
      "symm": 1689,
      "fin": 1690,
      "rans": 1691,
      "Ring": 1692,
      "_add": 1693,
      "jective": 1694,
      "val": 1695,
      "mem_": 1696,
      "oc": 1697,
      "lib": 1698,
      "ty": 1699,
      "ere": 1700,
      "thlib": 1701,
      "ic": 1702,
      "Space": 1703,
      "only": 1704,
      "Add": 1705,
      "inv": 1706,
      "Mathlib": 1707,
      "Mono": 1708,
      "rable": 1709,
      "instance": 1710,
      "mk": 1711,
      "ta": 1712,
      "all": 1713,
      "Measu": 1714,
      "import": 1715,
      "Comm": 1716,
      "ial": 1717,
      "gr": 1718,
      "his": 1719,
      "ir": 1720,
      "Nat": 1721,
      "Or": 1722,
      "ur": 1723,
      "At": 1724,
      "iz": 1725,
      "pow": 1726,
      "fine": 1727,
      "`,": 1728,
      "Algebra": 1729,
      "lim": 1730,
      "egory": 1731,
      "[←": 1732,
      "Of": 1733,
      "map_": 1734,
      "With": 1735,
      "<|": 1736,
      "set_": 1737,
      "sed": 1738,
      "sup": 1739,
      "s_": 1740,
      "um": 1741,
      "hs": 1742,
      "cc": 1743,
      "mage": 1744,
      "Iso": 1745,
      "ack": 1746,
      "orp": 1747,
      "where": 1748,
      "Linear": 1749,
      "St": 1750,
      "le_": 1751,
      "norm": 1752,
      "Po": 1753,
      "this": 1754,
      "((": 1755,
      "ity": 1756,
      "image": 1757,
      "module": 1758,
      "comm": 1759,
      "Real": 1760,
      "Op": 1761,
      "section": 1762,
      "that": 1763,
      ")]": 1764,
      "equ": 1765,
      "mono": 1766,
      "_apply": 1767,
      "),": 1768,
      "sion": 1769,
      "trans": 1770,
      "sum": 1771,
      "prod": 1772,
      "ect": 1773,
      "obj": 1774,
      "pre": 1775,
      "ad": 1776,
      "ol": 1777,
      "Monoid": 1778,
      "polog": 1779,
      "ift": 1780,
      "ef": 1781,
      "Order": 1782,
      "Category": 1783,
      "intro": 1784,
      "non": 1785,
      "Finset": 1786,
      "ot_": 1787,
      "its": 1788,
      "refine": 1789,
      "mpty": 1790,
      "par": 1791,
      "rict": 1792,
      "itive": 1793,
      "neg": 1794,
      "using": 1795,
      "Module": 1796,
      "ses": 1797,
      "back": 1798,
      "assoc": 1799,
      "type": 1800,
      "coe_": 1801,
      "lt_": 1802,
      "Group": 1803,
      "tain": 1804,
      "ate": 1805,
      "Has": 1806,
      "ral": 1807,
      "algebra": 1808,
      "exist": 1809,
      "Lo": 1810,
      "rim": 1811,
      "*}": 1812,
      "hism": 1813,
      "orphism": 1814,
      "congr": 1815,
      "const": 1816,
      "we": 1817,
      "continuous": 1818,
      "range": 1819,
      "rib": 1820,
      "/-": 1821,
      "Continuous": 1822,
      "Int": 1823,
      "_sub": 1824,
      "per": 1825,
      "di": 1826,
      "lex": 1827,
      "clo": 1828,
      "Finite": 1829,
      "inf": 1830,
      "one_": 1831,
      "open": 1832,
      "top": 1833,
      "ilter": 1834,
      "Sem": 1835,
      "jo": 1836,
      "has": 1837,
      "inter": 1838,
      "ical": 1839,
      "card": 1840,
      "ated": 1841,
      "Topolog": 1842,
      "oun": 1843,
      "cases": 1844,
      "deal": 1845,
      "Ex": 1846,
      "ward": 1847,
      "ull": 1848,
      "tic": 1849,
      "ion": 1850,
      "pos": 1851,
      "Norm": 1852,
      "reser": 1853,
      "egral": 1854,
      "od": 1855,
      "rom": 1856,
      "Theory": 1857,
      "Local": 1858,
      "lt": 1859,
      "cl": 1860,
      "dis": 1861,
      "duct": 1862,
      "div": 1863,
      "simpa": 1864,
      "are": 1865,
      "measu": 1866,
      "univ": 1867,
      "Sup": 1868,
      "sing": 1869,
      "obtain": 1870,
      "Eq": 1871,
      "ded": 1872,
      "ker": 1873,
      "_eq": 1874,
      "hd": 1875,
      "nat": 1876,
      "ight": 1877,
      "strict": 1878,
      "ree": 1879,
      "supp": 1880,
      "ens": 1881,
      "_comp": 1882,
      "_in": 1883,
      "Measure": 1884,
      "then": 1885,
      "ho": 1886,
      "Le": 1887,
      "hp": 1888,
      "not": 1889,
      "Zero": 1890,
      "ne": 1891,
      "Within": 1892,
      "af": 1893,
      "sto": 1894,
      "reserve": 1895,
      "group": 1896,
      "Measurable": 1897,
      "endsto": 1898,
      "limit": 1899,
      "Der": 1900,
      "ors": 1901,
      "ci": 1902,
      "be": 1903,
      "hi": 1904,
      "Diff": 1905,
      "Lim": 1906,
      "hy": 1907,
      "len": 1908,
      ".{": 1909,
      "hg": 1910,
      "gen": 1911,
      "_iff_": 1912,
      "wo": 1913,
      "pan": 1914,
      "cast": 1915,
      "nam": 1916,
      "eld": 1917,
      "Unit": 1918,
      "ke": 1919,
      "succ": 1920,
      "leton": 1921,
      "Cl": 1922,
      "sure": 1923,
      "get": 1924,
      "lf": 1925,
      "An": 1926,
      "pi": 1927,
      "asis": 1928,
      "from": 1929,
      "Ideal": 1930,
      "omial": 1931,
      "Clo": 1932,
      "Function": 1933,
      "Li": 1934,
      "⁻¹": 1935,
      "Deriv": 1936,
      "self": 1937,
      "smul_": 1938,
      "##": 1939,
      "left": 1940,
      "linear": 1941,
      "oo": 1942,
      "_additive": 1943,
      "finite": 1944,
      "to_additive": 1945,
      "ring": 1946,
      "iring": 1947,
      "ang": 1948,
      "tr": 1949,
      "Top": 1950,
      "LinearMap": 1951,
      "Pre": 1952,
      "Functor": 1953,
      "pect": 1954,
      "ruct": 1955,
      "20": 1956,
      "te": 1957,
      "ure": 1958,
      "exp": 1959,
      "eval": 1960,
      "hb": 1961,
      "equiv": 1962,
      "hn": 1963,
      "function": 1964,
      "riv": 1965,
      "Se": 1966,
      "ization": 1967,
      "onempty": 1968,
      "_zero": 1969,
      "com": 1970,
      "atri": 1971,
      "names": 1972,
      "enti": 1973,
      "ected": 1974,
      "indu": 1975,
      "_left": 1976,
      "ative": 1977,
      ")).": 1978,
      "ces": 1979,
      "min": 1980,
      "file": 1981,
      "ht": 1982,
      "des": 1983,
      "EN": 1984,
      "wer": 1985,
      "Fi": 1986,
      "order": 1987,
      "namespace": 1988,
      "If": 1989,
      "use": 1990,
      "eff": 1991,
      "ally": 1992,
      "ind": 1993,
      "lift": 1994,
      "_le_": 1995,
      "option": 1996,
      "cy": 1997,
      "ensor": 1998,
      "atrix": 1999,
      "',": 2000,
      "two": 2001,
      "deriv": 2002,
      "_mul_": 2003,
      "Open": 2004,
      "eri": 2005,
      "_mul": 2006,
      "Au": 2007,
      "₂)": 2008,
      "diff": 2009,
      "do": 2010,
      "iform": 2011,
      "')": 2012,
      "exists_": 2013,
      "ullback": 2014,
      "Submodule": 2015,
      "tient": 2016,
      "not_": 2017,
      "lyn": 2018,
      "under": 2019,
      "lynomial": 2020,
      "dep": 2021,
      "functor": 2022,
      "heaf": 2023,
      "rime": 2024,
      "Left": 2025,
      "ding": 2026,
      "Non": 2027,
      "/-!": 2028,
      "lement": 2029,
      "set_option": 2030,
      "hc": 2031,
      "nd": 2032,
      "ense": 2033,
      "ag": 2034,
      "Multi": 2035,
      "desc": 2036,
      "asi": 2037,
      "Par": 2038,
      "ast": 2039,
      "Sh": 2040,
      "AddComm": 2041,
      "Class": 2042,
      "Trans": 2043,
      "List": 2044,
      "Ch": 2045,
      "ber": 2046,
      "Complex": 2047,
      "bi": 2048,
      "ry": 2049,
      "ension": 2050,
      "algebraMap": 2051,
      "ounded": 2052,
      "integral": 2053,
      "pec": 2054,
      "e_zero": 2055,
      "Filter": 2056,
      "max": 2057,
      "ant": 2058,
      "SMul": 2059,
      "row": 2060,
      "pl": 2061,
      "coe": 2062,
      "ary": 2063,
      "'.": 2064,
      "This": 2065,
      "restrict": 2066,
      "alse": 2067,
      "closure": 2068,
      "ase": 2069,
      "ator": 2070,
      "Ar": 2071,
      "Right": 2072,
      "cat": 2073,
      "_right": 2074,
      "Matrix": 2075,
      "tendsto": 2076,
      "space": 2077,
      "tial": 2078,
      "ong": 2079,
      "injective": 2080,
      "ble": 2081,
      "backward": 2082,
      "nel": 2083,
      "che": 2084,
      "unit": 2085,
      "Semiring": 2086,
      "etri": 2087,
      "so": 2088,
      "alen": 2089,
      "cle": 2090,
      "joint": 2091,
      "simp_": 2092,
      "omorphism": 2093,
      "tru": 2094,
      "rivial": 2095,
      "Prop": 2096,
      "intype": 2097,
      "Closed": 2098,
      "''": 2099,
      "ange": 2100,
      "gener": 2101,
      "ancel": 2102,
      "bed": 2103,
      "py": 2104,
      "Homo": 2105,
      "comput": 2106,
      "comap": 2107,
      "add_": 2108,
      "false": 2109,
      "ght_": 2110,
      "Ob": 2111,
      "202": 2112,
      "comp_": 2113,
      "product": 2114,
      "Obj": 2115,
      "cont": 2116,
      "ig": 2117,
      "Field": 2118,
      "Topological": 2119,
      "Inf": 2120,
      "Prod": 2121,
      "monoid": 2122,
      "calar": 2123,
      "mpr": 2124,
      "NReal": 2125,
      "_eq_zero": 2126,
      "ructure": 2127,
      "smul": 2128,
      "bedding": 2129,
      "join": 2130,
      "Topology": 2131,
      "ome": 2132,
      "span": 2133,
      "pr": 2134,
      "`-": 2135,
      "hds": 2136,
      "CategoryTheory": 2137,
      "local": 2138,
      "equal": 2139,
      "Basis": 2140,
      "infer": 2141,
      "point": 2142,
      "eries": 2143,
      "fst": 2144,
      "erenti": 2145,
      "_neg": 2146,
      "verse": 2147,
      "ata": 2148,
      "trivial": 2149,
      "Quo": 2150,
      "ser": 2151,
      "ular": 2152,
      "_smul": 2153,
      "computable": 2154,
      "Normed": 2155,
      "defin": 2156,
      "Ad": 2157,
      "cre": 2158,
      "hm": 2159,
      "_pos": 2160,
      "etric": 2161,
      "Pa": 2162,
      "true": 2163,
      "Quotient": 2164,
      "unt": 2165,
      "forall": 2166,
      "noncomputable": 2167,
      "egrable": 2168,
      "We": 2169,
      "])": 2170,
      "inal": 2171,
      "can": 2172,
      "Polynomial": 2173,
      "Limit": 2174,
      "rank": 2175,
      "simps": 2176,
      "_mem": 2177,
      "⟩,": 2178,
      "measure": 2179,
      "IsS": 2180,
      "..": 2181,
      "sin": 2182,
      "vd": 2183,
      "sur": 2184,
      "Fintype": 2185,
      "dist": 2186,
      "some": 2187,
      "Sum": 2188,
      "posi": 2189,
      "Dis": 2190,
      "At_": 2191,
      "As": 2192,
      "`:": 2193,
      "_lt_": 2194,
      "measurable": 2195,
      "Icc": 2196,
      "Product": 2197,
      "singleton": 2198,
      "Union": 2199,
      "asic": 2200,
      "reserves": 2201,
      "tected": 2202,
      "ise": 2203,
      "preimage": 2204,
      "All": 2205,
      "protected": 2206,
      "Like": 2207,
      "filter": 2208,
      ";>": 2209,
      "<;>": 2210,
      "Def": 2211,
      "Tensor": 2212,
      "₁,": 2213,
      "exists": 2214,
      "hr": 2215,
      "rcases": 2216,
      "rintro": 2217,
      "Alg": 2218,
      "simp_rw": 2219,
      "Dec": 2220,
      "Deg": 2221,
      "induction": 2222,
      "sho": 2223,
      "coeff": 2224,
      "Rel": 2225,
      "Lp": 2226,
      "ain": 2227,
      "']": 2228,
      "ased": 2229,
      "_inv": 2230,
      "dvd": 2231,
      "subset_": 2232,
      "plic": 2233,
      "Compact": 2234,
      "ame": 2235,
      "reserved": 2236,
      "Copy": 2237,
      "whi": 2238,
      "iqu": 2239,
      "Em": 2240,
      "describ": 2241,
      "dex": 2242,
      "Colimit": 2243,
      "ence": 2244,
      "cancel": 2245,
      "₁.": 2246,
      "For": 2247,
      "attr": 2248,
      "ft_": 2249,
      "ute": 2250,
      "logy": 2251,
      "rel": 2252,
      "iven": 2253,
      "idable": 2254,
      "ner": 2255,
      "prop": 2256,
      "LI": 2257,
      "RingHom": 2258,
      "element": 2259,
      "h_": 2260,
      "described": 2261,
      "actic": 2262,
      "ural": 2263,
      "TopologicalSpace": 2264,
      "thors": 2265,
      "perty": 2266,
      "SE": 2267,
      "erentiable": 2268,
      "Qu": 2269,
      "Nonempty": 2270,
      "Rele": 2271,
      "Inst": 2272,
      "mo": 2273,
      "Copyright": 2274,
      "Authors": 2275,
      "rights": 2276,
      "license": 2277,
      "Apa": 2278,
      "Apache": 2279,
      "CEN": 2280,
      "which": 2281,
      "LICEN": 2282,
      "LICENSE": 2283,
      "Released": 2284,
      "right_": 2285,
      "ound": 2286,
      ")`": 2287,
      "trib": 2288,
      "Simp": 2289,
      "amp": 2290,
      "dual": 2291,
      "structure": 2292,
      "LE": 2293,
      "Integral": 2294,
      "Inter": 2295,
      "omain": 2296,
      "cone": 2297,
      "Pi": 2298,
      "_sing": 2299,
      "multi": 2300,
      "_non": 2301,
      "erm": 2302,
      "₂.": 2303,
      "respect": 2304,
      "anti": 2305,
      "closed": 2306,
      "iso": 2307,
      "pres": 2308,
      "Char": 2309,
      "One": 2310,
      "`(": 2311,
      "deg": 2312,
      "_one": 2313,
      "refl": 2314,
      "Instance": 2315,
      "Uniform": 2316,
      "ample": 2317,
      "over": 2318,
      "_nat": 2319,
      "Localization": 2320,
      "star": 2321,
      "arg": 2322,
      "ition": 2323,
      "Cast": 2324,
      "Series": 2325,
      "Limits": 2326,
      "valu": 2327,
      "out": 2328,
      "WithinAt": 2329,
      "ful": 2330,
      "cons": 2331,
      "eta": 2332,
      "norm_": 2333,
      "union": 2334,
      "ique": 2335,
      "orph": 2336,
      "CommRing": 2337,
      "Decidable": 2338,
      "Embedding": 2339,
      "au": 2340,
      "alence": 2341,
      "empty": 2342,
      "Ext": 2343,
      "vex": 2344,
      "Cont": 2345,
      "support": 2346,
      "no": 2347,
      "example": 2348,
      "Data": 2349,
      "surjective": 2350,
      "pullback": 2351,
      "old": 2352,
      "actor": 2353,
      "omorph": 2354,
      "lete": 2355,
      "atTop": 2356,
      "toFun": 2357,
      "redu": 2358,
      "morphism": 2359,
      "aliz": 2360,
      "ck": 2361,
      "ually": 2362,
      "vert": 2363,
      "ev": 2364,
      "Indep": 2365,
      "ay": 2366,
      "form": 2367,
      "(-": 2368,
      "pose": 2369,
      "AddCommGroup": 2370,
      "_b": 2371,
      "ou": 2372,
      "ord": 2373,
      "aly": 2374,
      "hab": 2375,
      "rong": 2376,
      "_self": 2377,
      "hain": 2378,
      "any": 2379,
      "root": 2380,
      "dsimp": 2381,
      "onal": 2382,
      "_m": 2383,
      "Action": 2384,
      "tone": 2385,
      "₁)": 2386,
      "crete": 2387,
      "_nhds": 2388,
      "angle": 2389,
      "bet": 2390,
      "Val": 2391,
      "_hom": 2392,
      "sig": 2393,
      "atti": 2394,
      "Subgroup": 2395,
      "Subtype": 2396,
      "Ker": 2397,
      "show": 2398,
      "ers": 2399,
      "by_": 2400,
      "ween": 2401,
      "sh": 2402,
      "snd": 2403,
      "ual": 2404,
      "_ne_zero": 2405,
      "Prime": 2406,
      "_of_is": 2407,
      "⟩⟩": 2408,
      "Tendsto": 2409,
      "imal": 2410,
      "_pow": 2411,
      "_symm": 2412,
      "topolog": 2413,
      "FDeriv": 2414,
      "sets": 2415,
      "umber": 2416,
      "Strict": 2417,
      "low": 2418,
      "between": 2419,
      "ree_": 2420,
      "category": 2421,
      "Ab": 2422,
      "cur": 2423,
      "hu": 2424,
      "attice": 2425,
      "_f": 2426,
      "iter": 2427,
      "t_iff": 2428,
      "_to": 2429,
      "_id": 2430,
      "assi": 2431,
      "entually": 2432,
      "diag": 2433,
      "Finsupp": 2434,
      "_map": 2435,
      "ents": 2436,
      "ency": 2437,
      "ᵒᵖ": 2438,
      "ENNReal": 2439,
      "``": 2440,
      "choo": 2441,
      "_subset_": 2442,
      "Su": 2443,
      "ates": 2444,
      "inser": 2445,
      "iSup": 2446,
      "char": 2447,
      "Basic": 2448,
      "field": 2449,
      "choose": 2450,
      "ced": 2451,
      "Star": 2452,
      "ped": 2453,
      "Bot": 2454,
      "Mod": 2455,
      "prime": 2456,
      "object": 2457,
      "gth": 2458,
      "_singleton": 2459,
      "single": 2460,
      "inferInstance": 2461,
      "Mon": 2462,
      "MDiff": 2463,
      "real": 2464,
      "inl": 2465,
      "Injective": 2466,
      "inr": 2467,
      "Locally": 2468,
      "assical": 2469,
      "clu": 2470,
      "Div": 2471,
      "ore": 2472,
      "ati": 2473,
      "cent": 2474,
      "limits": 2475,
      "_const": 2476,
      "DefEq": 2477,
      "_mono": 2478,
      "₂,": 2479,
      "Shap": 2480,
      "Const": 2481,
      "Bounded": 2482,
      "grind": 2483,
      "cated": 2484,
      "nected": 2485,
      "ami": 2486,
      "];": 2487,
      "root_": 2488,
      "bin": 2489,
      "isDefEq": 2490,
      "aph": 2491,
      "parency": 2492,
      "index": 2493,
      "Kernel": 2494,
      "Id": 2495,
      "adj": 2496,
      "hz": 2497,
      "commut": 2498,
      "tra": 2499,
      "sem": 2500,
      "₂]": 2501,
      "ali": 2502,
      "Mem": 2503,
      "ther": 2504,
      "definition": 2505,
      "Gr": 2506,
      "cover": 2507,
      "rect": 2508,
      "congr_": 2509,
      "natural": 2510,
      "Transparency": 2511,
      "Arrow": 2512,
      "ih": 2513,
      "Point": 2514,
      "since": 2515,
      "ne_": 2516,
      "alk": 2517,
      "sum_": 2518,
      "le_of_": 2519,
      "unop": 2520,
      "respectTransparency": 2521,
      "Mk": 2522,
      "hk": 2523,
      "sition": 2524,
      "_is": 2525,
      "untable": 2526,
      "⟨⟨": 2527,
      "homo": 2528,
      "sq": 2529,
      "Dual": 2530,
      "such": 2531,
      "ose": 2532,
      "ection": 2533,
      "Lie": 2534,
      "MonoidHom": 2535,
      "[∀": 2536,
      "wise": 2537,
      "sult": 2538,
      "extend": 2539,
      "Lift": 2540,
      "constru": 2541,
      "(·": 2542,
      "_nonneg": 2543,
      "alias": 2544,
      "rev": 2545,
      "Spec": 2546,
      "uniform": 2547,
      "additive": 2548,
      "_root_": 2549,
      "ift_": 2550,
      "Gen": 2551,
      "nonneg": 2552,
      "ations": 2553,
      ")))": 2554,
      "Partial": 2555,
      "Unital": 2556,
      "Pullback": 2557,
      "fle": 2558,
      "basis": 2559,
      "_I": 2560,
      "urn": 2561,
      "cond": 2562,
      "abs": 2563,
      "Di": 2564,
      "reduci": 2565,
      "Integrable": 2566,
      "mall": 2567,
      "left_": 2568,
      "ps": 2569,
      "mod": 2570,
      "kernel": 2571,
      "jection": 2572,
      "Dist": 2573,
      "Not": 2574,
      "*)": 2575,
      "fun_": 2576,
      "mon": 2577,
      "_smul_": 2578,
      "amily": 2579,
      "Ro": 2580,
      "plit": 2581,
      "ite_": 2582,
      "_succ": 2583,
      "length": 2584,
      "prim": 2585,
      "Mv": 2586,
      "→+": 2587,
      "_injective": 2588,
      "by_cases": 2589,
      "osition": 2590,
      "etry": 2591,
      "iUnion": 2592,
      "Ordered": 2593,
      "vi": 2594,
      "hj": 2595,
      "_t": 2596,
      "rwa": 2597,
      "Af": 2598,
      "version": 2599,
      "Free": 2600,
      "to_": 2601,
      "expose": 2602,
      "Pres": 2603,
      "depre": 2604,
      "ell": 2605,
      "fa": 2606,
      "hv": 2607,
      "Property": 2608,
      "ive": 2609,
      "elim": 2610,
      "gu": 2611,
      "Ne": 2612,
      "ram": 2613,
      "(.": 2614,
      "Form": 2615,
      "also": 2616,
      "Multiset": 2617,
      "Analy": 2618,
      "Tactic": 2619,
      "NonUnital": 2620,
      "deprecated": 2621,
      "forget": 2622,
      "isker": 2623,
      "whisker": 2624,
      "Metric": 2625,
      "class": 2626,
      "rpow": 2627,
      "conj": 2628,
      "convert": 2629,
      "dist_": 2630,
      "defeq": 2631,
      "dition": 2632,
      "Closure": 2633,
      "cf": 2634,
      "sco": 2635,
      "fun_prop": 2636,
      ")}": 2637,
      "Com": 2638,
      "ofReal": 2639,
      "go": 2640,
      "und": 2641,
      "Domain": 2642,
      "ility": 2643,
      "Affine": 2644,
      "imension": 2645,
      "ometry": 2646,
      "Tower": 2647,
      "_add_": 2648,
      "cycle": 2649,
      "_def": 2650,
      "when": 2651,
      "eventually": 2652,
      "Over": 2653,
      "AlgHom": 2654,
      "Cone": 2655,
      "inclu": 2656,
      "Submonoid": 2657,
      "Coeff": 2658,
      "Aux": 2659,
      "isomorphism": 2660,
      "else": 2661,
      "subset": 2662,
      "⁻¹'": 2663,
      "ess": 2664,
      "Card": 2665,
      "_norm": 2666,
      "ne_zero": 2667,
      "turn": 2668,
      "preserves": 2669,
      "finrank": 2670,
      "_lt": 2671,
      "Attrib": 2672,
      "cor": 2673,
      "_mem_": 2674,
      "oi": 2675,
      "reducible": 2676,
      "fix": 2677,
      "functions": 2678,
      "term": 2679,
      "DecidableEq": 2680,
      "nonempty": 2681,
      "_assoc": 2682,
      "Sch": 2683,
      "Th": 2684,
      "Valu": 2685,
      "equivalence": 2686,
      "calarTower": 2687,
      "lift_": 2688,
      "_app": 2689,
      "maps": 2690,
      "base": 2691,
      "Sheaf": 2692,
      "chain": 2693,
      "LT": 2694,
      "rongly": 2695,
      "suf": 2696,
      "Back": 2697,
      "Max": 2698,
      "·)": 2699,
      "result": 2700,
